[
    {
        "id": 0,
        "challenge": "Write a query to select the first name and last name, from the employees table and rename the column names in the result.",
        "hint": "Use the AS keyword in the SELECT statement to rename the column names."
    },
    {
        "id": 1,
        "challenge": "Write a query to select the supplier id, supplier name, and country from the suppliers table where the country is 'USA'.",
        "hint": "Use the WHERE clause to filter the rows based on the country condition."
    },
    {
        "id": 2,
        "challenge": "Write a query to select the top 5 products based on the highest price.",
        "hint": "Use the ORDER BY clause to sort the results by price in descending order, and the LIMIT clause to retrieve the top 5 rows."
    },
    {
        "id": 3,
        "challenge": "Write a query to count the total number of orders from the orders table.",
        "hint": "Use the COUNT(*) function to count the number of rows in the orders table."
    },
    {
        "id": 4,
        "challenge": "Write a query to calculate the average price of the products from the products table.",
        "hint": "Use the AVG() function to calculate the average value of the price column."
    },
    {
        "id": 5,
        "challenge": "Write a query to calculate the total number of customers for each country",
        "hint": "Use the GROUP BY clause to group the results by country, and the COUNT(*) function to count the number of customers for each group."
    },
    {
        "id": 6,
        "challenge": "Write a query to select the product name and price from the products table where the price is greater than the average price of all products.",
        "hint": "Use a sub-query to determine the average price."
    },
    {
        "id": 7,
        "challenge": "Write a query to select distinct city values from the customers table.",
        "hint": "Use the DISTINCT keyword in the SELECT statement to retrieve unique city values."
    },
    {
        "id": 8,
        "challenge": "Write a query to select the product name and unit from the products table where the product name starts with 'Ch'.",
        "hint": "Use the LIKE operator with a wildcard pattern in the WHERE clause to filter the product names."
    },
    {
        "id": 9,
        "challenge": "Write a query to select the order date and count of orders for each order date from the orders table.",
        "hint": "Use the GROUP BY clause to group the results by order date, and the COUNT(*) function to count the orders for each group."
    },
    {
        "id": 10,
        "challenge": "Write a query to select the product name and price from the products table, but only for products with a price between $10 and $20.",
        "hint": "Use the BETWEEN operator in the WHERE clause to filter the price range."
    },
    {
        "id": 11,
        "challenge": "Write a query to select the customer name and country from the customers table, but only for customers from the United States or Canada.",
        "hint": "Use the IN operator in the WHERE clause to filter the countries."
    },
    {
        "id": 12,
        "challenge": "Write a query to select the category name and description from the categories table, but only for categories whose description contains the word 'product'.",
        "hint": "Use the LIKE operator with a wildcard pattern in the WHERE clause to search for the word 'product' in the description."
    },
    {
        "id": 13,
        "challenge": "Write a query to select the employee id and first name from the employees table, but only for employees whose last name ends with 'an'.",
        "hint": "Use the LIKE operator with a wildcard pattern in the WHERE clause to filter the last names."
    },
    {
        "id": 14,
        "challenge": "Write a query to select the full name of all the employees.",
        "hint": "Use google to find out how to concatenate two columns and the AS keyword in the SELECT statement to rename it."
    },
    {
        "id": 15,
        "challenge": "Write a query to select the supplier id and supplier name from the suppliers table, but only for suppliers whose supplier name doesn't contains a space character.",
        "hint": "Use the NOT LIKE operator with a wildcard pattern in the WHERE clause to search for the space character in the supplier name."
    },
    {
        "id": 16,
        "challenge": "Write a query to select the product name and unit from the products table, but only for products whose unit contains the word 'bottle'.",
        "hint": "Use the LIKE operator with a wildcard pattern in the WHERE clause to search for the word 'bottle' in the unit column."
    },
    {
        "id": 17,
        "challenge": "Write a query to select the customer name and city from the customers table, but only for customers located in the city of 'New York'.",
        "hint": "Use the equality operator in the WHERE clause to filter the city."
    }
]
